//Powershell Detection 
//Detects when non-system or non-admin users used Powershell commands
DeviceProcessEvents
| where FileName has_any ("powershell.exe", "powershell_ise.exe")
| where ProcessCommandLine has_any  ("Set-ExecutionPolicy", " Bypass","EncodedCommand","-NoProfile","Invoke","Downloadfile" )
| where AccountDomain !contains "nt authority"
| where InitiatingProcessAccountDomain !contains "nt authority"
| where AccountDomain !contains "iway" 